In [2]:
people= {"first" : ["agung","kurao","mandako"],
        "last":["dwipa","anas","anas"],
        "email": ["agungdwipa@gmail.com","kuraoanas@gmail.com","mandakoanas@gmail.com"]}

In [3]:
import pandas as pd
data = pd.DataFrame(people)

In [4]:
data

     first   last                  email
0    agung  dwipa   agungdwipa@gmail.com
1    kurao   anas    kuraoanas@gmail.com
2  mandako   anas  mandakoanas@gmail.com

In [26]:
data["full_name"] = data["first"] + " " + data["last"]

In [27]:
data

     first   last                  email     full_name
0    agung  dwipa   agungdwipa@gmail.com   agung dwipa
1    kurao   anas    kuraoanas@gmail.com    kurao anas
2  mandako   anas  mandakoanas@gmail.com  mandako anas

In [28]:
data.drop(columns=["first","last"],inplace=True)

In [29]:
data

                   email     full_name
0   agungdwipa@gmail.com   agung dwipa
1    kuraoanas@gmail.com    kurao anas
2  mandakoanas@gmail.com  mandako anas

In [31]:
data["full_name"].str.split(" ",expand=True)

         0      1
0    agung  dwipa
1    kurao   anas
2  mandako   anas

In [32]:
data[["first","last"]] = data["full_name"].str.split(" ",expand=True)

In [33]:
data

                   email     full_name    first   last
0   agungdwipa@gmail.com   agung dwipa    agung  dwipa
1    kuraoanas@gmail.com    kurao anas    kurao   anas
2  mandakoanas@gmail.com  mandako anas  mandako   anas

In [41]:
data = data.append({"first":"gugun"},ignore_index=True)

In [37]:
people= {"first" : ["panji","tugus"],
        "last":["dwila","agus"],
        "email": ["panji@gmail.com","tugus1@gmail.com"]}
data2 = pd.DataFrame(people)

In [43]:
data.append(data2,ignore_index=True)

                   email     full_name    first   last
0   agungdwipa@gmail.com   agung dwipa    agung  dwipa
1    kuraoanas@gmail.com    kurao anas    kurao   anas
2  mandakoanas@gmail.com  mandako anas  mandako   anas
3                    NaN           NaN    gugun    NaN
4        panji@gmail.com           NaN    panji  dwila
5       tugus1@gmail.com           NaN    tugus   agus

In [45]:
data = data.append(data2,ignore_index=True)

In [75]:
data.drop(index=[4,3],inplace=True)

In [82]:
data

                   email     full_name    first   last
0   agungdwipa@gmail.com   agung dwipa    agung  dwipa
1    kuraoanas@gmail.com    kurao anas    kurao   anas
2  mandakoanas@gmail.com  mandako anas  mandako   anas
5       tugus1@gmail.com                  tugus   agus

In [102]:
filt = data["last"] == "anas"
data.drop(index=data[filt].index)

                  email    full_name  first   last
0  agungdwipa@gmail.com  agung dwipa  agung  dwipa

In [103]:
data

                   email     full_name    first   last
0   agungdwipa@gmail.com   agung dwipa    agung  dwipa
1    kuraoanas@gmail.com    kurao anas    kurao   anas
2  mandakoanas@gmail.com  mandako anas  mandako   anas